In [29]:
#groupby()메서드 사용 
from pandas import Series, DataFrame
import numpy as np 

df = DataFrame({'key1':['a','a','b','b','a'], 
                'key2':['one','two','one','two','one'], 
                'data1':np.random.randn(5), 
                'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.102776  0.542747
1    a  two -0.529135 -0.571296
2    b  one  2.867489 -0.660919
3    b  two -1.285484 -1.522461
4    a  one -0.330985 -0.601392

In [30]:
#그룹핑 기준:key1, key2 슬라이싱 
grouped = df.groupby("key2")["data2"]
grouped

In [31]:
print( grouped.mean() )
print( grouped.sum() )
print( grouped.count() )

key2
one   -0.239855
two   -1.046878
Name: data2, dtype: float64
key2
one   -0.719564
two   -2.093757
Name: data2, dtype: float64
key2
one    3
two    2
Name: data2, dtype: int64

In [32]:
#복합키(key1, key2 우선순위를 배정) ==> 메서드체인(함수체인)
means = df.groupby( ["key2","key1"] )["data1"].count()
means

key2  key1
one   a       2
      b       1
two   a       1
      b       1
Name: data1, dtype: int64

In [1]:
from pandas import Series, DataFrame
import numpy as np 

#학급 성적 
dfClass = DataFrame({"학급":[1,1,2,2,1], 
                     "이름":["홍길동","전우치","이순신","박문수","김길동"],
                     "국어":[100,90,95,100,80], 
                     "영어":[80,90,95,92,89], 
                     "수학":[90,80,92,100,80]
                     })

dfClass

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
2   2  이순신   95  95   92
3   2  박문수  100  92  100
4   1  김길동   80  89   80

In [2]:
#합계
sum(dfClass["국어"])

465

In [3]:
#평균
sum(dfClass["국어"])/5

93.0

In [4]:
#오름차순
dfClass.sort_values("국어")

   학급   이름   국어  영어   수학
4   1  김길동   80  89   80
1   1  전우치   90  90   80
2   2  이순신   95  95   92
0   1  홍길동  100  80   90
3   2  박문수  100  92  100

In [37]:
#내림차순
dfClass.sort_values("국어", ascending=False)

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
3   2  박문수  100  92  100
2   2  이순신   95  95   92
1   1  전우치   90  90   80
4   1  김길동   80  89   80

In [5]:
#새로운 컬럼 추가하기
dfClass["전체"] = dfClass["국어"] + dfClass["수학"] + dfClass["영어"]

In [6]:
#평균을 추가하기 
dfClass["평균"] = (dfClass["국어"] + dfClass["수학"] + dfClass["영어"])/3

In [7]:
dfClass

   학급   이름   국어  영어   수학   전체         평균
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
2   2  이순신   95  95   92  282  94.000000
3   2  박문수  100  92  100  292  97.333333
4   1  김길동   80  89   80  249  83.000000

In [8]:
#내림차순 정렬하기 
dfClass.sort_values("평균", ascending=True)

   학급   이름   국어  영어   수학   전체         평균
4   1  김길동   80  89   80  249  83.000000
1   1  전우치   90  90   80  260  86.666667
0   1  홍길동  100  80   90  270  90.000000
2   2  이순신   95  95   92  282  94.000000
3   2  박문수  100  92  100  292  97.333333

In [10]:
#학급별로 그룹핑하기 
dfClass.groupby("학급")["국어"].count()

학급
1    3
2    2
Name: 국어, dtype: int64

In [11]:
dfClass.agg(수학평균=("수학","count"))

      수학
수학평균   5

In [44]:
dfClass.groupby("학급").agg(수학평균=("수학","mean"))

         수학평균
학급
1   83.333333
2   96.000000

In [45]:
dfClass.groupby("학급").agg(국어평균=("국어","mean"), 
            수학평균=("수학","mean"),
            영어평균=("영어","mean"), 
            갯수=("학급","count"))

    국어평균       수학평균       영어평균  갯수
학급
1   90.0  83.333333  86.333333   3
2   97.5  96.000000  93.500000   2